OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
  doc["gfcicount"] = evse.getFaultCountGFCI();
  doc["nogndcount"] = evse.getFaultCountNoGround();
  doc["stuckcount"] = evse.getFaultCountStuckRelay();

  doc["solar"] = divert.getSolar();
  doc["grid_ie"] = divert.getGridIe();
  doc["charge_rate"] = divert.getChargeRate();
  doc["divert_update"] = (millis() - divert.getLastUpdate()) / 1000;
  doc["divert_active"] = divert.isActive();
  doc["shaper"] = shaper.getState()?1:0;
  doc["shaper_live_pwr"] = shaper.getLivePwr();
  // doc["shaper_cur"] = shaper.getChgCur();
  doc["shaper_cur"] = shaper.getMaxCur();
  doc["shaper_updated"] = shaper.isUpdated();
  doc["service_level"] = static_cast<uint8_t>(evse.getActualServiceLevel());
  doc["limit"] = limit.hasLimit();

  doc["ota_update"] = (int)Update.isRunning();

  doc["config_version"] = config_version();
  doc["claims_version"] = evse.getClaimsVersion();
  doc["override_version"] = manual.getVersion();
  doc["schedule_version"] = scheduler.getVersion();
  doc["schedule_plan_version"] = scheduler.getPlanVersion();
  doc["limit_version"] = limit.getVersion();

  doc["vehicle_state_update"] = (millis() - evse.getVehicleLastUpdated()) / 1000;
  if(teslaClient.getVehicleCnt() > 0) {
    doc["tesla_vehicle_count"] = teslaClient.getVehicleCnt();
    doc["tesla_vehicle_id"] = teslaClient.getVehicleId(teslaClient.getCurVehicleIdx());
    doc["tesla_vehicle_name"] = teslaClient.getVehicleDisplayName(teslaClient.getCurVehicleIdx());
    teslaClient.getChargeInfoJson(doc);
  } else {
    doc["tesla_vehicle_count"] = false;
    doc["tesla_vehicle_id"] = false;
    doc["tesla_vehicle_name"] = false;
    if(evse.isVehicleStateOfChargeValid()) {
      doc["battery_level"] = evse.getVehicleStateOfCharge();
    }
    if(evse.isVehicleRangeValid()) {
      doc["battery_range"] = evse.getVehicleRange();
    }
    if(evse.isVehicleEtaValid()) {
      doc["time_to_full_charge"] = evse.getVehicleEta();
    }
    if(evse.isVehicleChargeLimitValid()) {
      doc["vehicle_charge_limit"] = evse.getVehicleChargeLimit();
    }
  }

#ifdef ENABLE_TSDB
  doc["tsdb_ready"] = tsdbEnergyLogger.isReady() ? 1 : 0;
  doc["tsdb_err"]   = tsdbEnergyLogger.initError();
#endif
  home_battery_add_status_fields(doc);

  DBUGF("/status ArduinoJson size: %dbytes", doc.size());
}

// -------------------------------------------------------------------
// Wifi scan
// url: /scan
// -------------------------------------------------------------------
void
handleScan(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_JSON)) {
    return;
  }

  DBUGF("Starting WiFi scan");
  bool scanStarted = net.wifiScanNetworks([request, response](int networksFound) {
    DBUGF("%d networks found", networksFound);
    response->print("[");
    for (int i = 0; i < networksFound; ++i) {
      if(i) response->print(",");
      StaticJsonDocument<256> network;
      network["rssi"] = WiFi.RSSI(i);
      network["ssid"] = WiFi.SSID(i);
      network["bssid"] = WiFi.BSSIDstr(i);
      network["channel"] = WiFi.channel(i);
      network["secure"] = WiFi.encryptionType(i);
      serializeJson(network, *response);
    }
    response->print("]");
    request->send(response);
  });

  if(!scanStarted) {
    DBUGLN("WiFi scan failed to start");
    response->print("[]");
    request->send(response);
  }
}

// -------------------------------------------------------------------
// Destructive actuators (/reset, /restart, /apoff, /divertmode, /shaper,
// /settime, /rfid/add) must not fire from a bare cross-site GET (e.g.
// <img src="/reset">). Require either a non-GET method or
// the SPA's custom header, which a cross-origin GET cannot set — defense in
// depth beyond SameSite=Strict on the worst-consequence endpoints. Sends 403
// and returns false when the request is a headerless GET; the caller's response
// stream is already open (from requestPreProcess).
// -------------------------------------------------------------------
static bool actuatorMethodAllowed(MongooseHttpServerRequest *request,
                                  MongooseHttpServerResponseStream *response)
{
  if(request->method() != HTTP_GET) {
    return true;
  }
  MongooseString xrw = request->headers("X-Requested-With");
  if(xrw.equals("OpenEVSE")) {
    return true;
  }
  response->setCode(403);
  response->print("Forbidden: use POST or the app");
  request->send(response);
  return false;
}

// -------------------------------------------------------------------
// Handle turning Access point off
// url: /apoff
// -------------------------------------------------------------------
void
handleAPOff(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  response->setCode(200);
  response->print("Turning AP Off");
  request->send(response);

  DBUGLN("Turning AP Off");
  apOffTime = millis() + 1000;
}

// -------------------------------------------------------------------
// Change divert mode (solar PV divert mode) e.g 1:Normal (default), 2:Eco
// url: /divertmode
// -------------------------------------------------------------------
void
handleDivertMode(MongooseHttpServerRequest *request){
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }

  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

  DivertMode divertmode = (DivertMode)(request->getParam("divertmode").toInt());
  divert.setMode(divertmode);

  response->setCode(200);
  response->print("Divert Mode changed");
  request->send(response);

  DBUGF("Divert Mode: %d", divertmode);
}

// -------------------------------------------------------------------
// Change current shaper mode 0:disable (default), 1:Enable
// url: /shaper
// -------------------------------------------------------------------
void
handleCurrentShaper(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if(false == requestPreProcess(request, response, CONTENT_TYPE_TEXT)) {
    return;
  }
  if(!actuatorMethodAllowed(request, response)) {
    return;
  }

