OpenEVSE/openevse_esp32_firmware/src/web_server.cpp
      }
  }
}

// WebSocket handshake authentication gate.
//
// Registered via ->onRequest() on every WebSocket endpoint, so it runs during
// MG_EV_WEBSOCKET_HANDSHAKE_REQUEST — before the 101 Switching Protocols
// response. On failure, requestAuthentication() sends a 401 and sets
// MG_F_SEND_AND_CLOSE; mongoose then skips handshake completion (see
// mongoose.c, MG_EV_WEBSOCKET_HANDSHAKE_REQUEST handling), so no onConnect
// fires and no data is ever pushed to an unauthenticated client. On success we
// return without sending a response and the handshake proceeds normally.
//
// Note: the library dispatches HANDSHAKE_REQUEST to the endpoint's onRequest
// handler when one is set, and onConnect/onFrame at the later HANDSHAKE_DONE /
// FRAME events, so gating here does not interfere with those callbacks.
void onWsAuthenticate(MongooseHttpServerRequest *request)
{
  if(!isAuthenticated(request)) {
    request->requestAuthentication(esp_hostname);
  }
}

void onWsConnect(MongooseHttpWebSocketConnection *connection)
{
  DBUGF("New client connected over ws");

  DynamicJsonDocument doc(STATUS_JSON_CAPACITY);
  buildStatus(doc);

  // Send only to the client that just connected. This used to call
  // web_server_event(), which broadcasts to every open websocket -- so one
  // client reconnecting pushed a full status to all of them. Under a
  // reconnect storm (a Home Assistant integration retrying, say) that
  // multiplies into a burst of full-status sends against connections that
  // never asked for one, straight into send buffers with no backpressure.
  String json;
  json.reserve(measureJson(doc) + 1);
  serializeJson(doc, json);
  connection->send(json);
}

/*
 * Really simple 'conversion' of ASCII to UTF-8, basically only a few places send >127 chars
 * so just filter those to be acceptable as UTF-8
 */
void web_server_send_ascii_utf8(const char *endpoint, const uint8_t *buffer, size_t size)
{
  char temp[size];
  for(int i = 0; i < size; i++) {
    temp[i] = buffer[i] & 0x7f;
  }
  server.sendAll(endpoint, WEBSOCKET_OP_TEXT, temp, size);
}

void handleMqttAction(MongooseHttpServerRequest *request) {
  MongooseHttpServerResponseStream *response;
  if (false == requestPreProcess(request, response)) return;

  if (HTTP_GET == request->method()) {
    DynamicJsonDocument doc(JSON_OBJECT_SIZE(8) + 384);
    doc["mqtt_connected"] = (int)mqtt.isConnected();
    doc["mqtt_status"]    = mqtt.getMqttStatus();
    if (mqtt.getBrokerIp()[0] != '\0')
      doc["mqtt_broker_ip"]      = mqtt.getBrokerIp();
    if (mqtt.getBrokerVersion()[0] != '\0')
      doc["mqtt_broker_version"] = mqtt.getBrokerVersion();
    if (mqtt.getConnectedSince() > 0)
      doc["mqtt_connected_since"] = (uint32_t)mqtt.getConnectedSince();
    if (mqtt.getLastRxTime() > 0)
      doc["mqtt_last_rx"]         = (uint32_t)mqtt.getLastRxTime();
    // Always include error fields (empty string when no failure) so the GUI can
    // clear a previously-shown reason once reconnected.
    doc["mqtt_error"]        = mqtt.getErrorCategory();
    doc["mqtt_error_detail"] = mqtt.getErrorDetail();
    response->setCode(200);
    serializeJson(doc, *response);
  } else if (HTTP_POST == request->method()) {
    mqtt.restartConnection();
    response->setCode(200);
    response->print("{\"msg\":\"done\"}");
  } else {
    response->setCode(405);
    response->print("{\"msg\":\"Method not allowed\"}");
  }
  request->send(response);
}

void web_server_setup()
{
  bool use_ssl = false;
  if(www_certificate_id != "")
  {
    // This one sits on the boot path. std::stoull throws on a malformed value
    // and nothing catches it, so a corrupted stored www_certificate_id would
    // abort inside web_server_setup() and boot-loop the unit with no way back
    // in over the network. Parse defensively and fall through to plain HTTP,
    // which at least leaves the device reachable to correct the config.
    const char *idStr = www_certificate_id.c_str();
    char *end = nullptr;
    errno = 0;
    unsigned long long parsed = strtoull(idStr, &end, 16);
    bool id_valid = (end != idStr && '\0' == *end && ERANGE != errno);
    if(!id_valid) {
      DEBUG.printf("Ignoring malformed www_certificate_id '%s', serving HTTP\n", idStr);
    }

    uint64_t cert_id = id_valid ? (uint64_t)parsed : 0;
    const char *cert = id_valid ? certs.getCertificate(cert_id) : NULL;
    const char *key = id_valid ? certs.getKey(cert_id) : NULL;
    if(NULL != cert && NULL != key)
    {
      DEBUG.printf("Starting HTTPS server, https://0.0.0.0:%d\n", www_https_port);
      server.begin(www_https_port, cert, key);
      use_ssl = true;

      redirect.begin(www_http_port);
      redirect.on("/", handleHttpsRedirect);
    }
  }

  if(false == use_ssl) {
    DEBUG.printf("Starting HTTP server, http://0.0.0.0:%d\n", www_http_port);
    server.begin(www_http_port);
  }

  // Session management (no auth gate — user must reach these unauthenticated)
  server.on("/login$", handleLogin);
  server.on("/logout$", handleLogout);

  // Handle status updates
  server.on("/status$", handleStatus);
  server.on("/config$", handleConfig);

  // Handle HTTP web interface button presses
  server.on("/teslaveh$", handleTeslaVeh);
  server.on("/tesla/vehicles$", handleTeslaVeh);
  server.on("/settime$", handleSetTime);
  server.on("/reset$", handleRst);
  server.on("/restart$", handleRestart);
  server.on("/rapi$", handleRapi);
  server.on("/r$", handleRapi);
  server.on("/scan$", handleScan);
  server.on("/apoff$", handleAPOff);
  server.on("/divertmode$", handleDivertMode);
  server.on("/shaper$", handleCurrentShaper);
  server.on("/emoncms/describe$", handleDescribe);
  server.on("/rfid/add$", handleAddRFID);

  server.on("/schedule/plan$", handleSchedulePlan);
  server.on("/schedule", handleSchedule);

  server.on("/claims/target$", handleEvseClaimsTarget);
  server.on("/claims", handleEvseClaims);

  server.on("/override$", handleOverride);

  server.on("/logs", handleEventLogs);
  server.on("/certificates", handleCertificates);
  server.on("/limit", handleLimit);
  server.on("/emeter", handleEmeter);
  server.on("/time", handleTime);
  server.on("/mqtt$", handleMqttAction);

#ifndef ENABLE_TSDB
  server.on("/energy/raw$", handleEnergyRaw);
  server.on("/energy/daily$", handleEnergyDaily);
  server.on("/energy/monthly$", handleEnergyMonthly);
  server.on("/energy/annual$", handleEnergyAnnual);
#else // ENABLE_TSDB
  server.on("/energy/raw$", handleEnergyRaw);
  server.on("/energy/daily$", handleEnergyDaily);
  server.on("/energy/weekly$", handleEnergyWeekly);
  server.on("/energy/monthly$", handleEnergyMonthly);
  server.on("/energy/annual$", handleEnergyAnnual);
#endif // ENABLE_TSDB

  // Simple Firmware Update Form
  server.on("/update$")->
    onRequest(handleUpdateRequest)->
    onUpload(handleUpdateUpload)->
    onClose(handleUpdateClose);

  // In-place 16MB flash repartition (16MB module flashed with 4MB layout)
  server.on("/migrate/expand16mb$", handleMigrateExpand16mb);
  server.on("/migrate/status$", handleMigrateStatus);
  server.on("/migrate/coredump$", handleMigrateCoredump);

